# Parameters
nc: 80  # number of classes
scales:
  n: [1.00, 1.00, 512]
backbone:
  # 0: full convnextv2 outputs
  - [-1, 1, Timm, [1024, 'convnextv2_base.fcmae_ft_in22k_in1k', True, True, 0, True]]
  
  - [0, 1, Index, [256, 1]]  # 1: P3 → 256 ch @ 28×28
  - [0, 1, Index, [512, 2]]  # 2: P4 → 512 ch @ 14×14
  - [0, 1, Index, [1024, 3]] # 3: P5 → 1024 ch @ 7×7
  
  # SPPF + PSA on P5
  - [-1, 1, SPPF, [1024, 5]]  # 4
  - [-1, 2, C2PSA, [1024]]

head:
  # P5 → upsample → concat with P4 → C3
  - [5,    1, nn.Upsample, [None, 2, "nearest"]]  # 1024
  - [[6, 2], 1, Concat,        [1]]               # 1024+512=1536
  - [7,    2, C3k2,            [512, False]]      # 1536 → 1024

  # P4 → upsample → concat with P3 → C3
  - [8,    1, nn.Upsample, [None, 2, "nearest"]]  # 1024
  - [[9, 1], 1, Concat,       [1]]                # 1024+256=1280
  - [10,   2, C3k2,            [256, False]]      # 1280 → 512

  # top-down → bottom-up
  - [11,   1, Conv,            [256, 3, 2]]       # 512 → 512
  - [[12, 7], 1, Concat,       [1]]               # 512+1024=1536
  - [13,   2, C3k2,            [512, False]]     # 1536 → 1024

  # bottom-up → P5
  - [14,   1, Conv,            [512, 3, 2]]      # 1024 → 1024
  - [[15, 3], 1, Concat,       [1]]               # 1024+1024=2048
  - [16,   2, C3k2,            [1024, False]]     # 2048 → 2048

  # Final Detect on (P3, P4, P5)
  - [[11, 14, 17], 1, Detect,   [nc]]            